constant/controlDict
application     reactingFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          0.001;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

runTimeModifiable true;

adjustTimeStep  yes;
maxCo           0.5;
